{
    "versions": [
        {
            "version": "2.2.2",
            "label": "Ver. 2.2.2 [Released 18/11/25]  ",
            "release_notes_html": "<div class=\"collapse\" id=\"v222\" rel=\"1\"> <h2>Version 2.2.2</h2> <ul><li>Small improvements have been made.</li><li>Additionally, the supported iOS versions have changed. iOS version 16.0 or higher is now required to use this app.</li></ul> </div>"
        },
        {
            "version": "2.0.0",
            "label": "Ver. 2.0.0 [Released 29/05/25]  ",
            "release_notes_html": "<div class=\"collapse\" id=\"v200\" rel=\"1\"> <h2>Version 2.0.0</h2> <p><strong>Nintendo Switch 2 consoles can now be linked.</strong></p> <ul><li>GameChat settings have been added. You can manage your child's chat partners and video chat usage. </li></ul> <p><strong>More features have been added.</strong></p> <ul><li>You can extend the play time limit.</li><li>You can now set a time from which gameplay on a linked console is allowed each day.</li><li>You can view more info under \"Play Activity\".</li><li>Alerts provide hints for supervising gameplay.</li><li>You can now link up to eight Nintendo Switch 2/Nintendo Switch consoles.</li></ul> <p>Other improvements have also been made.</p> </div>"
        },
        {
            "version": "1.22.0",
            "label": "Ver. 1.22.0 [Released 03/12/24]  ",
            "release_notes_html": "<div class=\"collapse\" id=\"v122\" rel=\"1\"> <h2>Version 1.22.0</h2> <ul><li>Changed minimum OS version. <ul><li>iOS version 15.0 or later is required to use this application.</li><li>Android OS version 8.0 or later is required to use this application.</li></ul> </li></ul> </div>"
        },
        {
            "version": "1.19.0",
            "label": "Ver. 1.19.0 [Released 14/09/23]  ",
            "release_notes_html": "<div class=\"collapse\" id=\"v119\" rel=\"1\"> <h2>Version 1.19.0</h2> <ul><li>Small improvements have been made.</li><li>Additionally, the supported iOS versions have changed. iOS version 14.0 or higher is now required to use this app.</li></ul> </div>"
        },
        {
            "version": "1.17.0",
            "label": "Ver. 1.17.0 [Released 18/09/18]  ",
            "release_notes_html": "<div class=\"collapse\" id=\"v17\" rel=\"1\"> <br> <h2>Version 1.17.0</h2> <ul><li>If you've set up Parental Controls on a Nintendo Switch console, articles that appear in that console's news feed will observe the Restricted Software settings. <ul><li>Settings are located in the application's Settings &gt; Restriction Level &gt; Restricted Software</li></ul> </li><li>Establishing a new Internet connection on a Nintendo Switch console with Parental Controls enabled no longer requires a PIN. When Notification Settings for the app are <a href=\"/en-gb/Support/Parental-Controls/How-to-Update-Notification-Settings-in-the-Nintendo-Switch-Parental-Controls-App-1494770.html\" class=\"\" target=\"nintendo\" title=\"How to Update Notification Settings in the Nintendo Switch Parental Controls App\">turned on</a>, a push notification will be sent to your smartphone when a new connection is established. </li><li>Feature improvements and bug fixes have been implemented.</li></ul> </div>"
        },
        {
            "version": "1.15.0",
            "label": "Ver. 1.15.0 [Released 11/03/18]  ",
            "release_notes_html": "<div class=\"collapse\" id=\"v15\" rel=\"1\"> <br> <h2>Version 1.15.0</h2> <ul><li>A new whitelist feature has been added. This feature allows you to add specific software titles to a whitelist in order to exclude them from the Parental Controls Restricted Software setting on the Nintendo Switch console.</li><li>You can now choose to lock this app. If you do, authentication via Touch ID or Face ID will be required to use the app.</li><li>The time range for the bedtime alarm has been extended to between 4:00 p.m. and 11:45 p.m.. When a bedtime alarm is set, play will be restricted from the set time until 6:00 a.m. the following day. </li><li>Settings made using this app will now be synced to the Nintendo Switch console even when it is in sleep mode.</li><li>Implemented feature improvements.</li><li>In order to use some of these features, you will need to update the Nintendo Switch system version to 5.0.0 or later.</li></ul> </div>"
        },
        {
            "version": "1.11.0",
            "label": "Ver. 1.11.0 [Released 19/07/17]  ",
            "release_notes_html": "<div class=\"collapse\" id=\"v11\" rel=\"1\"> <br> <h2>Version 1.11.0</h2> <p>In order to use these features, you will need to update the Nintendo Switch system version to 3.0.0 or later.</p> <ul><li>User play time can now be viewed in more detail. <ul><li>You can now view information about time and software played separately for each Nintendo Switch user, as well as time not spent playing games such as using the HOME Menu. ( Games that don’t have the user selection sequence will be displayed as “No user selected”.)</li><li>You can view the times when Parental Controls were temporarily disabled.</li><li>You can check what software was downloaded, and you will receive a push notification on your smart device when new software is downloaded on the console.</li></ul> </li><li>Monthly summaries now have more detailed information. <ul><li>You can view information such as the number of days and amount of time played for each user. </li><li>In addition to viewing how many days the console was used in a month, you can now check the amount of time as well.</li><li>”Versus last month” has been added so you can compare the time played this month with the previous month.</li><li>”Share” button was added for you to share monthly summaries among family members.</li></ul> </li><li>\"Disable Alarms for Today” has been added in the settings. <ul><li>This feature disables all alarms on the console for the rest of the day and can be used when you want to let your child play for longer than normal on special occasions such as their birthday or on a holiday. (Enabling this will show the active time in “Time Played”.)</li></ul> </li></ul> </div>"
        }
    ],
    "url": "https://www.nintendo.com/en-gb/Support/Parental-Controls/How-to-Download-or-Update-the-Nintendo-Switch-Parental-Controls-Smart-Device-App-1497986.html"
}
